In [178]:
import pandas as pd
import numpy as np

In [102]:
myDataset = {
    'cars': ['BMW', 'Volvo', 'Ford'],
     'passings': [3, 7, 2]
}

myVar = pd.DataFrame(myDataset)

print(myVar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

# Series

In [103]:
a = [1, 7, 2]
myVar = pd.Series(a)
print(myVar)

0    1
1    7
2    2
dtype: int64

In [104]:
myVar[0]

1

In [105]:
myVar = pd.Series(a, index = ['x', 'y', 'z'])
myVar

x    1
y    7
z    2
dtype: int64

In [106]:
print(myVar['x'])
print(myVar['y'])
print(myVar['z'])

1
7
2

In [107]:
for ele in myVar:
    print(ele)

1
7
2

In [108]:
print(myVar)

x    1
y    7
z    2
dtype: int64

In [109]:
calories = {'day1': 420, 'day2': 380, 'day3': 390}
myVar = pd.Series(calories)
print(myVar)

day1    420
day2    380
day3    390
dtype: int64

In [110]:
for i in myVar:
    print(i)

420
380
390

In [111]:
myVar['day1']

420

In [112]:
myVar = pd.Series(calories, index = ['day1', 'day2', 'day3'])

In [113]:
print(myVar['day1'])
print(myVar['day3'])

420
390

# DataFrame

In [114]:
data = {
    'calories': [420, 380, 390],
    'duration': [50, 40, 45]
}

# load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

### locate Row

In [115]:
# The example returns a Pandas Series.
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [116]:
# when we use [], the result would be a Pandas DataFrame.
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

### Named Indexes

In [117]:
df = pd.DataFrame(data, index = ['day1', 'day2', 'day3'])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

### locate Named Indexes

In [118]:
print(df.loc['day1'])
print()
print(df.loc['day2'])

calories    420
duration     50
Name: day1, dtype: int64

calories    380
duration     40
Name: day2, dtype: int64

### Load Files into a DataFrame

In [119]:
df = pd.read_csv('username.csv', sep = ';')
print(df)

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

### Read CSV Files

In [120]:
df = pd.read_csv('data.csv')

# use to_string() method to print the entire DataFrame
print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.0
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.0
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [121]:
# By default when we print the dataFame, we get the first 5 rows, and the last 5 rows.
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [122]:
# df.shape to print the shape of DataFame
print(df.shape)

(169, 4)

In [123]:
print(df.head())

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

### Read JSON Files

In [124]:
df = pd.read_json('data.json')

print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.5
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.5
37         60    100       120     300.1
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.1
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

### Dictionary as JSON

#### JSON = Python Dictionary

JSON objects have the same format as Python Dictionaries.

In [125]:
data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

In [126]:
df = pd.DataFrame(data)

print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

### Examples:

In [127]:
iris = pd.read_csv('iris.csv')
print(iris)

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [128]:
print(type(iris))

<class 'pandas.core.frame.DataFrame'>

In [129]:
df = iris.copy()

In [130]:
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [131]:
df.shape

(150, 5)

In [132]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [133]:
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [134]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [135]:
df.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [136]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [137]:
df['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [138]:
df.isnull()

     sepal.length  sepal.width  petal.length  petal.width  variety
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [139]:
df.isnull().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     0
variety         0
dtype: int64

In [140]:
df.iloc[1:4, 2:3]

   petal.length
1           1.4
2           1.3
3           1.5

In [141]:
df.iloc[1:4, 2:4]

   petal.length  petal.width
1           1.4          0.2
2           1.3          0.2
3           1.5          0.2

In [142]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [143]:
df.drop(0)
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

No change in df occured, because df.drop() created a copy of df and made a change to that one. If we store that return value to a variable and then we can see that changes happened to that variable.
eg.

In [144]:
a = df.drop(0)
a.head()

   sepal.length  sepal.width  petal.length  petal.width variety
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa

But if we wanna make some changes to the original DataFrame, then we can set the inplace argument of drop function to <b>True</b>

In [145]:
a

     sepal.length  sepal.width  petal.length  petal.width    variety
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[149 rows x 5 columns]

In [146]:
df.drop(0, inplace = True)
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa

In [147]:
a

     sepal.length  sepal.width  petal.length  petal.width    variety
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[149 rows x 5 columns]

In [148]:
a.drop(1, inplace = True)

In [149]:
a

     sepal.length  sepal.width  petal.length  petal.width    variety
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
6             4.6          3.4           1.4          0.3     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[148 rows x 5 columns]

In [150]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [151]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
           dtype='int64', length=149)

In [152]:
df.index[0]

1

In [153]:
df.drop(df.index[0], inplace = True)
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa

In [154]:
df.drop(df.index[[0,1]], inplace = True)
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa
8           4.4          2.9           1.4          0.2  Setosa

In [155]:
df.drop(df.index[range(2)], inplace = True)
df.head()

    sepal.length  sepal.width  petal.length  petal.width variety
6            4.6          3.4           1.4          0.3  Setosa
7            5.0          3.4           1.5          0.2  Setosa
8            4.4          2.9           1.4          0.2  Setosa
9            4.9          3.1           1.5          0.1  Setosa
10           5.4          3.7           1.5          0.2  Setosa

In [156]:
df['sepal.length'] > 5

6      False
7      False
8      False
9      False
10      True
       ...
145     True
146     True
147     True
148     True
149     True
Name: sepal.length, Length: 144, dtype: bool

In [157]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [158]:
df.columns = ['sl', 'sw', 'pl', 'pw', 'variety']
df.columns

Index(['sl', 'sw', 'pl', 'pw', 'variety'], dtype='object')

In [159]:
df.sl > 5

6      False
7      False
8      False
9      False
10      True
       ...
145     True
146     True
147     True
148     True
149     True
Name: sl, Length: 144, dtype: bool

In [160]:
df[df.sl > 5]

      sl   sw   pl   pw    variety
10   5.4  3.7  1.5  0.2     Setosa
14   5.8  4.0  1.2  0.2     Setosa
15   5.7  4.4  1.5  0.4     Setosa
16   5.4  3.9  1.3  0.4     Setosa
17   5.1  3.5  1.4  0.3     Setosa
..   ...  ...  ...  ...        ...
145  6.7  3.0  5.2  2.3  Virginica
146  6.3  2.5  5.0  1.9  Virginica
147  6.5  3.0  5.2  2.0  Virginica
148  6.2  3.4  5.4  2.3  Virginica
149  5.9  3.0  5.1  1.8  Virginica

[116 rows x 5 columns]

In [161]:
df[df.variety == 'Virginica']

      sl   sw   pl   pw    variety
100  6.3  3.3  6.0  2.5  Virginica
101  5.8  2.7  5.1  1.9  Virginica
102  7.1  3.0  5.9  2.1  Virginica
103  6.3  2.9  5.6  1.8  Virginica
104  6.5  3.0  5.8  2.2  Virginica
105  7.6  3.0  6.6  2.1  Virginica
106  4.9  2.5  4.5  1.7  Virginica
107  7.3  2.9  6.3  1.8  Virginica
108  6.7  2.5  5.8  1.8  Virginica
109  7.2  3.6  6.1  2.5  Virginica
110  6.5  3.2  5.1  2.0  Virginica
111  6.4  2.7  5.3  1.9  Virginica
112  6.8  3.0  5.5  2.1  Virginica
113  5.7  2.5  5.0  2.0  Virginica
114  5.8  2.8  5.1  2.4  Virginica
115  6.4  3.2  5.3  2.3  Virginica
116  6.5  3.0  5.5  1.8  Virginica
117  7.7  3.8  6.7  2.2  Virginica
118  7.7  2.6  6.9  2.3  Virginica
119  6.0  2.2  5.0  1.5  Virginica
120  6.9  3.2  5.7  2.3  Virginica
121  5.6  2.8  4.9  2.0  Virginica
122  7.7  2.8  6.7  2.0  Virginica
123  6.3  2.7  4.9  1.8  Virginica
124  6.7  3.3  5.7  2.1  Virginica
125  7.2  3.2  6.0  1.8  Virginica
126  6.2  2.8  4.8  1.8  Virginica
127  6.1  3.0  4.9  1.8  Virginica
128  6.4  2.8  5.6  2.1  Virginica
129  7.2  3.0  5.8  1.6  Virginica
130  7.4  2.8  6.1  1.9  Virginica
131  7.9  3.8  6.4  2.0  Virginica
132  6.4  2.8  5.6  2.2  Virginica
133  6.3  2.8  5.1  1.5  Virginica
134  6.1  2.6  5.6  1.4  Virginica
135  7.7  3.0  6.1  2.3  Virginica
136  6.3  3.4  5.6  2.4  Virginica
137  6.4  3.1  5.5  1.8  Virginica
138  6.0  3.0  4.8  1.8  Virginica
139  6.9  3.1  5.4  2.1  Virginica
140  6.7  3.1  5.6  2.4  Virginica
141  6.9  3.1  5.1  2.3  Virginica
142  5.8  2.7  5.1  1.9  Virginica
143  6.8  3.2  5.9  2.3  Virginica
144  6.7  3.3  5.7  2.5  Virginica
145  6.7  3.0  5.2  2.3  Virginica
146  6.3  2.5  5.0  1.9  Virginica
147  6.5  3.0  5.2  2.0  Virginica
148  6.2  3.4  5.4  2.3  Virginica
149  5.9  3.0  5.1  1.8  Virginica

In [162]:
df[df.variety == 'Virginica'].describe()

             sl         sw         pl        pw
count  50.00000  50.000000  50.000000  50.00000
mean    6.58800   2.974000   5.552000   2.02600
std     0.63588   0.322497   0.551895   0.27465
min     4.90000   2.200000   4.500000   1.40000
25%     6.22500   2.800000   5.100000   1.80000
50%     6.50000   3.000000   5.550000   2.00000
75%     6.90000   3.175000   5.875000   2.30000
max     7.90000   3.800000   6.900000   2.50000

In [163]:
df.head()

     sl   sw   pl   pw variety
6   4.6  3.4  1.4  0.3  Setosa
7   5.0  3.4  1.5  0.2  Setosa
8   4.4  2.9  1.4  0.2  Setosa
9   4.9  3.1  1.5  0.1  Setosa
10  5.4  3.7  1.5  0.2  Setosa

In [164]:
df.iloc[0]

sl            4.6
sw            3.4
pl            1.4
pw            0.3
variety    Setosa
Name: 6, dtype: object

In [165]:
df.loc[0]

KeyError: 0

In [ ]:
df.loc[6]

<p><b>iloc</b> gets the value by <b>position</b>, and 
<b>loc</b> gets the value by <b>label</b> </p>

In [ ]:
df.tail()

In [ ]:
# add a row
df.loc[150] = [1, 2, 3, 4, 'Iris-setosa']

In [ ]:
df.tail()

In [ ]:
df.reset_index(drop = True, inplace = True)

In [166]:
df.index

Int64Index([  6,   7,   8,   9,  10,  11,  12,  13,  14,  15,
            ...
            140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
           dtype='int64', length=144)

In [167]:
# axis = 0 means row-wise, and axis = 1 means columns-wise operation.

# delete a column

df.drop('sl', axis = 1, inplace = True)

In [168]:
df

      sw   pl   pw    variety
6    3.4  1.4  0.3     Setosa
7    3.4  1.5  0.2     Setosa
8    2.9  1.4  0.2     Setosa
9    3.1  1.5  0.1     Setosa
10   3.7  1.5  0.2     Setosa
..   ...  ...  ...        ...
145  3.0  5.2  2.3  Virginica
146  2.5  5.0  1.9  Virginica
147  3.0  5.2  2.0  Virginica
148  3.4  5.4  2.3  Virginica
149  3.0  5.1  1.8  Virginica

[144 rows x 4 columns]

In [169]:
df.describe()

               sw          pl          pw
count  144.000000  144.000000  144.000000
mean     3.043750    3.854167    1.239583
std      0.434961    1.735958    0.751243
min      2.000000    1.000000    0.100000
25%      2.800000    1.600000    0.375000
50%      3.000000    4.400000    1.350000
75%      3.300000    5.100000    1.800000
max      4.400000    6.900000    2.500000

In [170]:
del df['sw']

In [171]:
df

      pl   pw    variety
6    1.4  0.3     Setosa
7    1.5  0.2     Setosa
8    1.4  0.2     Setosa
9    1.5  0.1     Setosa
10   1.5  0.2     Setosa
..   ...  ...        ...
145  5.2  2.3  Virginica
146  5.0  1.9  Virginica
147  5.2  2.0  Virginica
148  5.4  2.3  Virginica
149  5.1  1.8  Virginica

[144 rows x 3 columns]

In [172]:
df.describe()

               pl          pw
count  144.000000  144.000000
mean     3.854167    1.239583
std      1.735958    0.751243
min      1.000000    0.100000
25%      1.600000    0.375000
50%      4.400000    1.350000
75%      5.100000    1.800000
max      6.900000    2.500000

In [173]:
df = iris.copy()
df.columns = ['sl', 'sw', 'pl', 'pw', 'variety']

In [174]:
df

      sl   sw   pl   pw    variety
0    5.1  3.5  1.4  0.2     Setosa
1    4.9  3.0  1.4  0.2     Setosa
2    4.7  3.2  1.3  0.2     Setosa
3    4.6  3.1  1.5  0.2     Setosa
4    5.0  3.6  1.4  0.2     Setosa
..   ...  ...  ...  ...        ...
145  6.7  3.0  5.2  2.3  Virginica
146  6.3  2.5  5.0  1.9  Virginica
147  6.5  3.0  5.2  2.0  Virginica
148  6.2  3.4  5.4  2.3  Virginica
149  5.9  3.0  5.1  1.8  Virginica

[150 rows x 5 columns]

In [175]:
df.describe()

               sl          sw          pl          pw
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.057333    3.758000    1.199333
std      0.828066    0.435866    1.765298    0.762238
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [176]:
df['diff_pl_pw'] = df['pl'] - df['pw']
df

      sl   sw   pl   pw    variety  diff_pl_pw
0    5.1  3.5  1.4  0.2     Setosa         1.2
1    4.9  3.0  1.4  0.2     Setosa         1.2
2    4.7  3.2  1.3  0.2     Setosa         1.1
3    4.6  3.1  1.5  0.2     Setosa         1.3
4    5.0  3.6  1.4  0.2     Setosa         1.2
..   ...  ...  ...  ...        ...         ...
145  6.7  3.0  5.2  2.3  Virginica         2.9
146  6.3  2.5  5.0  1.9  Virginica         3.1
147  6.5  3.0  5.2  2.0  Virginica         3.2
148  6.2  3.4  5.4  2.3  Virginica         3.1
149  5.9  3.0  5.1  1.8  Virginica         3.3

[150 rows x 6 columns]

In [179]:
df.iloc[2:4, 1:3] = np.nan
df.head()

    sl   sw   pl   pw variety  diff_pl_pw
0  5.1  3.5  1.4  0.2  Setosa         1.2
1  4.9  3.0  1.4  0.2  Setosa         1.2
2  4.7  NaN  NaN  0.2  Setosa         1.1
3  4.6  NaN  NaN  0.2  Setosa         1.3
4  5.0  3.6  1.4  0.2  Setosa         1.2

In [180]:
df.describe()

               sl          sw          pl          pw  diff_pl_pw
count  150.000000  148.000000  148.000000  150.000000  150.000000
mean     5.843333    3.056081    3.789865    1.199333    2.558667
std      0.828066    0.438648    1.755525    0.762238    1.051696
min      4.300000    2.000000    1.000000    0.100000    0.800000
25%      5.100000    2.800000    1.600000    0.300000    1.300000
50%      5.800000    3.000000    4.400000    1.300000    2.900000
75%      6.400000    3.325000    5.100000    1.800000    3.300000
max      7.900000    4.400000    6.900000    2.500000    4.700000

In [182]:
df.dropna(inplace = True)

In [183]:
df.head()

    sl   sw   pl   pw variety  diff_pl_pw
0  5.1  3.5  1.4  0.2  Setosa         1.2
1  4.9  3.0  1.4  0.2  Setosa         1.2
4  5.0  3.6  1.4  0.2  Setosa         1.2
5  5.4  3.9  1.7  0.4  Setosa         1.3
6  4.6  3.4  1.4  0.3  Setosa         1.1

In [184]:
df.reset_index(drop = True, inplace = True)
df.head()

    sl   sw   pl   pw variety  diff_pl_pw
0  5.1  3.5  1.4  0.2  Setosa         1.2
1  4.9  3.0  1.4  0.2  Setosa         1.2
2  5.0  3.6  1.4  0.2  Setosa         1.2
3  5.4  3.9  1.7  0.4  Setosa         1.3
4  4.6  3.4  1.4  0.3  Setosa         1.1

In [185]:
df.iloc[2:4, 1:3] = np.nan
df.head()

    sl   sw   pl   pw variety  diff_pl_pw
0  5.1  3.5  1.4  0.2  Setosa         1.2
1  4.9  3.0  1.4  0.2  Setosa         1.2
2  5.0  NaN  NaN  0.2  Setosa         1.2
3  5.4  NaN  NaN  0.4  Setosa         1.3
4  4.6  3.4  1.4  0.3  Setosa         1.1

In [188]:
df.sw.fillna(df.sw.mean(), inplace = True)
df.pl.fillna(df.pl.mean(), inplace = True)

In [189]:
df.head()

    sl        sw        pl   pw variety  diff_pl_pw
0  5.1  3.500000  1.400000  0.2  Setosa         1.2
1  4.9  3.000000  1.400000  0.2  Setosa         1.2
2  5.0  3.046575  3.820548  0.2  Setosa         1.2
3  5.4  3.046575  3.820548  0.4  Setosa         1.3
4  4.6  3.400000  1.400000  0.3  Setosa         1.1

In [191]:
# string based data
df['Gender'] = 'Female'
df.iloc[0:10,6] = 'Male'

In [192]:
df.head()

    sl        sw        pl   pw variety  diff_pl_pw Gender
0  5.1  3.500000  1.400000  0.2  Setosa         1.2   Male
1  4.9  3.000000  1.400000  0.2  Setosa         1.2   Male
2  5.0  3.046575  3.820548  0.2  Setosa         1.2   Male
3  5.4  3.046575  3.820548  0.4  Setosa         1.3   Male
4  4.6  3.400000  1.400000  0.3  Setosa         1.1   Male

In [193]:
df

      sl        sw        pl   pw    variety  diff_pl_pw  Gender
0    5.1  3.500000  1.400000  0.2     Setosa         1.2    Male
1    4.9  3.000000  1.400000  0.2     Setosa         1.2    Male
2    5.0  3.046575  3.820548  0.2     Setosa         1.2    Male
3    5.4  3.046575  3.820548  0.4     Setosa         1.3    Male
4    4.6  3.400000  1.400000  0.3     Setosa         1.1    Male
..   ...       ...       ...  ...        ...         ...     ...
143  6.7  3.000000  5.200000  2.3  Virginica         2.9  Female
144  6.3  2.500000  5.000000  1.9  Virginica         3.1  Female
145  6.5  3.000000  5.200000  2.0  Virginica         3.2  Female
146  6.2  3.400000  5.400000  2.3  Virginica         3.1  Female
147  5.9  3.000000  5.100000  1.8  Virginica         3.3  Female

[148 rows x 7 columns]

In [194]:
def f(s):
    if s == 'Female':
        return 0
    else:
        return 1
    
df['sex'] = df.Gender.apply(f)
df

      sl        sw        pl   pw    variety  diff_pl_pw  Gender  sex
0    5.1  3.500000  1.400000  0.2     Setosa         1.2    Male    1
1    4.9  3.000000  1.400000  0.2     Setosa         1.2    Male    1
2    5.0  3.046575  3.820548  0.2     Setosa         1.2    Male    1
3    5.4  3.046575  3.820548  0.4     Setosa         1.3    Male    1
4    4.6  3.400000  1.400000  0.3     Setosa         1.1    Male    1
..   ...       ...       ...  ...        ...         ...     ...  ...
143  6.7  3.000000  5.200000  2.3  Virginica         2.9  Female    0
144  6.3  2.500000  5.000000  1.9  Virginica         3.1  Female    0
145  6.5  3.000000  5.200000  2.0  Virginica         3.2  Female    0
146  6.2  3.400000  5.400000  2.3  Virginica         3.1  Female    0
147  5.9  3.000000  5.100000  1.8  Virginica         3.3  Female    0

[148 rows x 8 columns]

In [195]:
del df['Gender']
df

      sl        sw        pl   pw    variety  diff_pl_pw  sex
0    5.1  3.500000  1.400000  0.2     Setosa         1.2    1
1    4.9  3.000000  1.400000  0.2     Setosa         1.2    1
2    5.0  3.046575  3.820548  0.2     Setosa         1.2    1
3    5.4  3.046575  3.820548  0.4     Setosa         1.3    1
4    4.6  3.400000  1.400000  0.3     Setosa         1.1    1
..   ...       ...       ...  ...        ...         ...  ...
143  6.7  3.000000  5.200000  2.3  Virginica         2.9    0
144  6.3  2.500000  5.000000  1.9  Virginica         3.1    0
145  6.5  3.000000  5.200000  2.0  Virginica         3.2    0
146  6.2  3.400000  5.400000  2.3  Virginica         3.1    0
147  5.9  3.000000  5.100000  1.8  Virginica         3.3    0

[148 rows x 7 columns]